'use strict';

//Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let strNumbers = '';
for(let i = 20; i <= 30; i = i + 0.5){
    strNumbers += i + ' ';
}
console.log(strNumbers);

//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

const dollar = 27;

for(let i = 10; i <= 100; i = i + 10){
    console.log(`${i} доларів коштує ${i*dollar} гривень`);
}

//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

const n = 47;
let strNumbersInt = `Всі цілі числа від 1 до 100, квадрат яких не перевищує числа N = ${n} - `;

for(let i = 1; i <= 100; i++){
    strNumbersInt += i ** 2 <= n ? i + ' ' : '';
}

console.log(strNumbersInt);

//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
let countDivisor = 0;

for(let i = 1; i <= n; i++){
    if(n % i === 0){
        countDivisor++;
    }
}
countDivisor < 3 ? console.log(`Число ${n} є простим`) : console.log(`Число ${n} не є простим`);

//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

if(Math.sqrt(n) % 1 === 0){
    console.log(`Можна одержати число ${n} шляхом зведення числа у деякий ступінь`);
}else{
    console.log(`Не можна одержати число ${n} шляхом зведення числа у деякий ступінь`);
}
